# DappedEnd

Representation of dapped end in IDEA StatiCa Detail

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.dapped_end import DappedEnd

# TODO update the JSON string below
json = "{}"
# create an instance of DappedEnd from a JSON string
dapped_end_instance = DappedEnd.from_json(json)
# print the JSON string representation of the object
print(DappedEnd.to_json())

# convert the object into a dict
dapped_end_dict = dapped_end_instance.to_dict()
# create an instance of DappedEnd from a dict
dapped_end_from_dict = DappedEnd.from_dict(dapped_end_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)